# Ortalaması 0 ve std sapması 1 olacak şekilde ayarlama yapılması gerekiyor.

In [5]:
dataset = {"İsim" : ["Murat", "Aslı", "Mehmet", "Mert"],
          "Soyad" : ["Sakal", "Sakal", "Mavi", "Noyan"],
          "Yaş" : [45,37, "bilinmiyor", 37],
          "Şehir" : ["Muğla", "Muğla", np.nan, "İzmir"],
          "Ülke": ["Türkiye","Türkiye","Türkiye","Türkiye"],
          "GANO" : [np.nan, np.nan, 3.9, np.nan]}

In [6]:
df = pd.DataFrame(dataset)

In [7]:
df

     İsim  Soyad         Yaş  Şehir     Ülke  GANO
0   Murat  Sakal          45  Muğla  Türkiye   NaN
1    Aslı  Sakal          37  Muğla  Türkiye   NaN
2  Mehmet   Mavi  bilinmiyor    NaN  Türkiye   3.9
3    Mert  Noyan          37  İzmir  Türkiye   NaN

In [12]:
df_2=df.drop(labels=["GANO", "Ülke"], axis=1)

In [13]:
df_2

     İsim  Soyad         Yaş  Şehir
0   Murat  Sakal          45  Muğla
1    Aslı  Sakal          37  Muğla
2  Mehmet   Mavi  bilinmiyor    NaN
3    Mert  Noyan          37  İzmir

In [14]:
df_2["Yaş"].replace("bilinmiyor", np.nan, inplace=True)

In [15]:
df_2

     İsim  Soyad   Yaş  Şehir
0   Murat  Sakal  45.0  Muğla
1    Aslı  Sakal  37.0  Muğla
2  Mehmet   Mavi   NaN    NaN
3    Mert  Noyan  37.0  İzmir

In [16]:
import numpy as np
from sklearn.impute import SimpleImputer

In [17]:
imp_freq = SimpleImputer(missing_values=np.nan, strategy="most_frequent")

In [18]:
df_2["Yaş"] = imp_freq.fit_transform(df_2[["Yaş"]])

In [19]:
df_2

     İsim  Soyad   Yaş  Şehir
0   Murat  Sakal  45.0  Muğla
1    Aslı  Sakal  37.0  Muğla
2  Mehmet   Mavi  37.0    NaN
3    Mert  Noyan  37.0  İzmir

In [26]:
df_2["Şehir"] = imp_freq.fit_transform(df_2[["Şehir"]])

In [27]:
df_2

     İsim  Soyad   Yaş  Şehir
0   Murat  Sakal  45.0  Muğla
1    Aslı  Sakal  37.0  Muğla
2  Mehmet   Mavi  37.0  Muğla
3    Mert  Noyan  37.0  İzmir

In [28]:
import numpy as np
from sklearn.preprocessing import StandardScaler

In [29]:
df_ss=df_2.copy()

In [32]:
df_ss["Yas_Scaled"] = StandardScaler().fit_transform(df_ss[["Yaş"]])

In [36]:
df_ss

     İsim  Soyad   Yaş  Şehir  Yas_Scaled
0   Murat  Sakal  45.0  Muğla    1.732051
1    Aslı  Sakal  37.0  Muğla   -0.577350
2  Mehmet   Mavi  37.0  Muğla   -0.577350
3    Mert  Noyan  37.0  İzmir   -0.577350

In [39]:
print(df_ss["Yaş"].mean())
print(df_ss["Yaş"].std())

39.0
4.0

In [40]:
print(df_ss["Yas_Scaled"].mean())
print(df_ss["Yas_Scaled"].std())

-5.551115123125783e-17
1.1547005383792517

# Min Max Scaler

In [42]:
from sklearn.preprocessing import MinMaxScaler

In [43]:
df_mm = df_2.copy()

In [44]:
df_mm

     İsim  Soyad   Yaş  Şehir
0   Murat  Sakal  45.0  Muğla
1    Aslı  Sakal  37.0  Muğla
2  Mehmet   Mavi  37.0  Muğla
3    Mert  Noyan  37.0  İzmir

In [45]:
df_mm["Yas_Scaled"] = MinMaxScaler().fit_transform(df_mm[["Yaş"]])

In [46]:
df_mm

     İsim  Soyad   Yaş  Şehir  Yas_Scaled
0   Murat  Sakal  45.0  Muğla         1.0
1    Aslı  Sakal  37.0  Muğla         0.0
2  Mehmet   Mavi  37.0  Muğla         0.0
3    Mert  Noyan  37.0  İzmir         0.0

In [47]:
print(df_mm["Yas_Scaled"].mean())
print(df_mm["Yas_Scaled"].std())

0.25
0.5

# Label Encoding

In [49]:
from sklearn.preprocessing import LabelEncoder

In [50]:
le=LabelEncoder()

In [51]:
df_le = df_2.copy()

In [52]:
le.fit(df_le["Şehir"])

LabelEncoder()

In [53]:
df_le["Şehir"] = le.transform(df_le["Şehir"])

In [54]:
df_le

     İsim  Soyad   Yaş  Şehir
0   Murat  Sakal  45.0      0
1    Aslı  Sakal  37.0      0
2  Mehmet   Mavi  37.0      0
3    Mert  Noyan  37.0      1

In [59]:
le.inverse_transform([0,1])

array(['Muğla', 'İzmir'], dtype=object)

In [60]:
pd.get_dummies(df_2["Şehir"])

   Muğla  İzmir
0      1      0
1      1      0
2      1      0
3      0      1